{
  "portfolio": [
    {
      "id": 1,
      "title": "Web Apps",
      "slug": "webapps",
      "image": "webapps.jpg",
      "applications": [
        {
          "id": 1,
          "title": "Astro Template",
          "slug": "astro",
          "image": "/img/astro.png",
          "link": "https://github.com/miadugas/astro-template",
          "site": "https://astro-test138.netlify.app/",
          "description": "Astro is an open-source static site generator that provides developers with a comprehensive set of tools for building content-rich websites. It is known for creating fast-loading sites with minimal production JavaScript, making it a popular choice for optimizing website performance. One of the standout features of Astro Template is its flexible approach to component usage, which allows developers to choose from a range of Astro components or integrate components from other popular frameworks like React, Vue, and Svelte. Astro also offers advanced optimization techniques such as image compression and code splitting, as well as server-side rendering to improve website performance. Overall, Astro Template is an excellent option for developers seeking to build dynamic and engaging websites with high standards for website performance and flexibility."
      
        },
        {
          "id": 2,
          "title": "JS Tetris",
          "slug": "tetris",
          "image": "/img/tetris.png",
          "link": "https://github.com/miadugas/JS-Tetris",
          "site": "https://miadugas.github.io/JS-Tetris/",
          "description": "JS Tetris is a thrilling and captivating game that utilizes JavaScript to challenge players to maneuver and rotate falling Tetris blocks to fit them into the available space without leaving any gaps. The objective is to complete horizontal rows of blocks without empty cells while avoiding letting the Tetris pieces reach the top of the screen. The game incorporates critical development concepts like graphics, game loops, and collision detection, which provide visually appealing and responsive gameplay, smooth mechanics, and accurate block placement, respectively. The fully functional game features points and levels that add an element of competition and progress as players advance through the game. As players progress through the levels, the game becomes progressively more challenging, providing a rewarding and exciting experience. Overall, JS Tetris is an addictive, challenging, and enjoyable game that offers hours of entertainment."
        },
        {
          "id": 3,
          "title": "Tim Furlow Fine Art",
          "slug": "tffa",
          "image": "/img/TFFA.png",
          "link": "https://github.com/miadugas/timfurlow_artsite",
          "site": "https://timfurlowfineart.vercel.app/",
          "description": "Tim Furlow Fine Art is an e-commerce site that offers a range of high-quality art pieces created by Tim Furlow. The site features an easy-to-navigate interface that allows users to browse and purchase art pieces online. The site also includes an admin area that enables Tim Furlow and his team to manage orders, users, and inventory efficiently. To facilitate secure and hassle-free transactions, the site is integrated with PayPal for payment processing. With its user-friendly design and robust features, Tim Furlow Fine Art is an excellent platform for art enthusiasts to discover and acquire beautiful works of art."
        },
        {
          "id": 4,
          "title": "Muse Messenger",
          "slug": "muse",
          "image": "/img/muse.png",
          "link": "https://github.com/miadugas/Muze-Messenger",
          "site": "https://affectionate-shirley-f54a8b.netlify.com/",
          "description": "The Realtime Jamstack chat application is a modern and dynamic chat application built on the Jamstack architecture. It uses server-side deployment on Heroku and client-side deployment on Netlify and Github to ensure reliable and fast performance. This application is easy to integrate into existing or new builds, making it a great choice for developers who want to add a chat feature to their websites or applications. With its real-time capabilities, the Realtime Jamstack chat application allows users to communicate seamlessly and efficiently. It is a standalone application that offers a range of features, including private messaging, group chats, and notifications. Its flexible design and easy integration make it an excellent option for businesses or individuals who want to enhance their online presence and connect with their audience in real-time."
        },
        {
          "id": 5,
          "title": "Color Tuner",
          "slug": "color-tuner",
          "image": "/img/color-tuner.png",
          "link": "https://github.com/miadugas/color-tuner",
          "site": "https://miacodes-colortuner.netlify.app/",
          "description": "The Color Tuner is a tool that allows users to input a hex color and receive a range of tints and shades of that color. This is a useful tool for designers who are putting together a UI direction and need to find the perfect combination of colors. The Color Tuner returns a variety of lighter tints and darker shades of the selected hex color, providing designers with a broad range of options to choose from. Once the desired color is selected, users can simply click on the color to copy it to their clipboard, making it easy to use in their design project. Overall, the Color Tuner is a simple yet powerful tool that streamlines the color selection process for designers, allowing them to easily find the right color scheme for their projects."
        },
        {
          "id": 6,
          "title": "Python Scraper",
          "slug": "scraper",
          "image": "/img/pyscraper.png",
          "link": "https://github.com/miadugas/Scraper",
          "description": "The Automated Python Web Scraping Bot is a powerful tool built using the popular Beautiful Soup library, enabling efficient web scraping and data extraction from websites. The bot is designed to automatically extract data and save it in CSV format, with the ability to send the file to an email address. The CSV file created by the bot is named based on the date it was created, ensuring that an archive of the scraped data can be easily maintained. This feature enables quick and easy access to historical data, providing a valuable resource for analysis and decision-making. Overall, the Automated Python Web Scraping Bot is an excellent choice for developers and data analysts looking for an efficient and reliable tool for web scraping and data extraction. The bot's ability to automatically send the CSV file via email and maintain an archive of historical data makes it an invaluable tool for businesses and organizations that rely on data-driven insights."
        },
        {
          "id": 7,
          "title": "Marbas",
          "slug": "marbas",
          "image": "/img/marbas.png",
          "link": "https://github.com/miadugas/marbas",
          "site": "https://marbas.netlify.app/",
          "description": "Marbas is built in React is a user-friendly web application that offers advanced features for monitoring cryptocurrency prices and historical data. Upon first visit, the app greets the user and prompts them to select their favorite coins. Using fuzzy search, users can easily add or remove coins from their list of favorites, with the chosen coins being disabled to prevent duplicates. The app then remembers the user's preferences, generating a dashboard with prices and historical data for their favorite coins. The dashboard displays the top 5 major coins for the first 5 favorites, and a compact view for the remaining 5. Users can also render a line chart for their current favorite coin, with historical points displayed by date, days, weeks, or months. With its intuitive interface and advanced functionality, the Cryptocurrency Dashboard offers a streamlined and efficient way for users to monitor and track their favorite cryptocurrencies."
        }
      ]
    },
    {
      "id": 2,
      "title": "Desktop",
      "slug": "desktop",
      "image": "desktop.jpg",
      "applications": [
        {
          "id": 8,
          "title": "Gremlin Tracker",
          "slug": "gremin",
          "image": "/img/gremlin.png",
          "link": "https://github.com/miadugas/Gremlin-Tracker",
          "description": "Gremlin Tracker is a client application built using ReactJS and ElectronJS that allows remote teams to track system gremlins and bugs. The app uses a MongoDB Atlas database to store and manage the data, ensuring that all team members have access to the latest information. With Gremlin Tracker, teams can easily monitor and manage issues in real-time, improving collaboration and productivity. The app provides an intuitive and user-friendly interface that makes it easy to add and track issues, assign tasks, and manage workflows. Overall, Gremlin Tracker is a powerful tool that can help remote teams stay organized and focused, improving their ability to deliver high-quality products and services. Its use of ReactJS and ElectronJS ensures a seamless and responsive user experience, while the integration with MongoDB Atlas provides reliable and secure data storage."
        },
        {
          "id": 9,
          "title": "ImageShrinker",
          "slug": "ishrink",
          "image": "/img/ishrink.png",
          "link": "https://github.com/miadugas/ImageShrinker",
          "description": "ImageShrinker is a user-friendly desktop application built on Electron, designed to optimize images for websites while preserving their original quality. With ImageShrinker, users can easily reduce the size of their images without sacrificing their overall appearance, improving website performance and load times. Using advanced algorithms, ImageShrinker analyzes images and automatically adjusts their size and compression, ensuring that they maintain their original quality while occupying less storage space. This makes it an invaluable tool for web developers and designers who need to optimize their images for fast and efficient web performance. Overall, ImageShrinker is a reliable and efficient application that offers a simple and effective way to optimize images for websites. Its user-friendly interface and automatic optimization features make it an ideal choice for anyone looking to improve website performance and speed up load times."
        }
      ]
    },
    {
      "id": 3,
      "title": "Mobile/PWA",
      "slug": "mbpwa",
      "image": "mbpwa.jpg",
      "applications": [
        {
          "id": 10,
          "title": "iLoftz",
          "slug": "iloftz",
          "image": "/img/iLoftz.png",
          "link": "https://github.com/miadugas/iLoftz_app",
          "site": "https://iloftz.firebaseapp.com/auth",
          "description": "The proposed app is a hybrid between AirBnB and Yelp, designed specifically for couch surfers. With the ability to create accounts, users can browse and book available properties, as well as rate their experiences. This app aims to provide an easy and efficient way for travelers to find affordable accommodations while also promoting responsible tourism. By enabling users to rate properties, future travelers can make informed decisions when choosing their accommodations. Overall, this app will provide a valuable service to travelers who seek affordable and reliable accommodations while also supporting local economies."
        }
      ]
    },
    {
      "id": 4,
      "title": "Showcase",
      "slug": "showcase",
      "image": "showcase.jpg",
      "applications": [
        {
          "id": 11,
          "title": "Grayify",
          "slug": "grayify",
          "image": "/grayify2.png",
          "link": "https://github.com/miadugas/grayify",
          "site": "https://grayify.netlify.app/",
          "description": "A utility application that stands out for its user-friendly interface and real-time image conversion capabilities. The clean and straightforward design, featuring modern UI elements and best practices, enables users to quickly grasp its functionality. Real-time feedback is provided by displaying the grayscale version of an image immediately upon upload, allowing users to see the result and make adjustments, ultimately enhancing the overall user experience. Additionally, the application offers customizable output options and caters to various user needs and preferences. Users can adjust settings such as canvas dimensions and file type, ensuring greater control over the final output. This attention to detail and focus on user experience, combined with the application's unique features, makes it an intriguing and valuable tool for image conversion."
        }
      ]
    }
  ]
}
